# Brew Dependencies

# Taps
tap "homebrew/cask-fonts"   # Font collection

# Editor
brew "neovim"
brew "bat"
brew "trash"
brew "csvlens"
brew "cookiecutter"
brew "thefuck"

# Navigation
brew "vifm"     # ViFileManager
brew "tree"     # Visualize Dir

# Search and filter
brew "fzf"      # Fuzzy search
brew "ripgrep"  # Improved Grep
brew "peco"     # Interactive filtering
brew "tig"      # Git interaction helper
brew "fd"       # Improved find
brew "jq"       # JSON Processor

# Network Tools
brew "wget"     # Get
brew "htop"     # Human Top

# Version Managers
brew "mise"     # Mise-en-place
brew "zplug"    # ZSH Plugin Manager

# `brew install --cask`
cask "qlmarkdown"           # Markdown QuickLook
cask "rectangle"            # Window Manager
cask "kitty"                # Terminal
cask "caffeine"             # Don't sleep
cask "font-hack-nerd-font"  # My font
