# Brew Dependencies

# Taps

tap "homebrew/cask-fonts"

# Editor
brew "neovim"
brew "bat"
brew "trash"
brew "csvlens"
brew "cookiecutter"
brew "thefuck"

# Navigation
brew "vifm"
brew "tree"

# Search and filter
brew "fzf"
brew "ripgrep"
brew "peco"
brew "tig"
brew "fd"
brew "jq"

# Network Tools
brew "wget"
brew "htop"
brew "speedtest-cli"

# Version Managers
brew "mise"
brew "zplug"

# Image Tools
brew "imagemagick"
brew "gifsicle"
brew "ffmpeg"

# iOS
brew "xcodesorg/made/xcodes"

# `brew install --cask`
cask "maccy"
cask "qlmarkdown"
cask "rectangle"
cask "kitty"
cask "alt-tab"
cask "caffeine"
cask "logi-options-plus"
cask "font-hack-nerd-font"
