# Brew Dependencies

# Taps

tap "federico-terzi/espanso"
tap "homebrew/cask-fonts"

# `brew install`

brew "nvim"
brew "maccy"
brew "wget"
brew "peco"
brew "tig"
brew "bat"
brew "vifm"
brew "ripgrep"
brew "fzf"
brew "imagemagick"
brew "htop"
brew "ffmpeg"
brew "gifsicle"
brew "vifm"
brew "w3m"
brew "trash"
brew "pyenv"
brew "virtualenv"
brew "pyenv-virtualenv"
brew "virtualenvwrapper"
brew "pyenv-virtualenvwrapper"
brew "thefuck"
brew "fd"
brew "qlmarkdown"
brew "cask"
brew "speedtest-cli"
brew "tree"
brew "thefuck"
brew "neovim"
brew "docker-compose"
brew "jq"
brew "ranger"
brew "fzf"
brew "mint"
brew "cookiecutter"
brew "espanso"
brew "fzf"

# `brew install --cask`

cask "qlmarkdown"
cask "rectangle"
cask "alacritty"
cask "macdown"
cask "kite"
cask "alt-tab"
cask "docker"
cask "caffeine"
cask "logi-options-plus"
cask "postman"
cask "google-chrome"
cask "calibre"
cask "quik"
cask "folx"
cask "discord"
cask "fliqlo"
cask "vlc"

cask "font-hack-nerd-font"
